Repository: seanpm2001/mt-training-data
Catalog: sd/sd_pontoon.tmx
Source language: en_us
Languages: sd

source: Each entry in the dataset consists of a unique MP3 and corresponding text file. Many of the <b>{ $total }</b> recorded hours in the dataset also include demographic metadata like age, sex, and accent that can help train the accuracy of speech recognition engines. The dataset currently consists of <b>{ $valid }</b> validated hours in <b>{ $languages }</b> languages, but we’re always adding more voices and languages. Take a look at our <languagesLink>Languages page</languagesLink> to request a language or start contributing.
sd: ڊيٽا سيٽ ۾ هر داخلا هڪ منفرد MP3 ۽ لاڳاپيل ٽيڪسٽ فائل تي مشتمل آهي. ڪيترن ئي <b>{ $total }</b>ڊيٽا سيٽ ۾ رڪارڊ ٿيل ڪلاڪن ۾ پڻ شامل آهن ڊيموگرافڪ ميٽاڊيٽا جهڙوڪ عمر، جنس، ۽ تلفظ جيڪي تقرير جي سڃاڻپ واري انجڻ جي درستگي کي تربيت ڏيڻ ۾ مدد ڪري سگھن ٿا. ڊيٽا سيٽ هن وقت تي مشتمل آهي <b>{ $valid }</b> تصديق ٿيل ڪلاڪن ۾ <b>{ $languages }</b> ٻولين ۾، پر اسان هميشه وڌيڪ آواز ۽ ٻوليون شامل ڪندا رهيا آهيون. اسان جي <languagesLink>Languages صفحو</languagesLink> تي هڪ نظر وٺو ڪنهن ٻولي جي درخواست ڪرڻ يا حصو ڏيڻ شروع ڪرڻ لاءِ.

source: Eastern Huasteca Nahuatl
sd: مشرقي هوسٽڪا نوهاٽلا

source: Easy
sd: آسان

source: Edit
sd: ترميم ڪريو

source: Edit Profile
sd: پروفائيل ۾ ترميم ڪريو

source: Email
sd: اي ميل

source: <emailFragment>Sign up</emailFragment> to our mailing list to learn how you can take part in campaigns, events and co-design features on Common Voice.
sd: <email Fragment>سائن اپ ڪريو</email Fragment> اسان جي ميلنگ لسٽ ۾ اهو سکڻ لاءِ ته توهان ڪامن وائس تي مهمن، واقعن ۽ ڪو-ڊزائن جي خاصيتن ۾ ڪيئن حصو وٺي سگهو ٿا.

source: Email is already used for a different account
sd: اي ميل اڳ ۾ ئي مختلف اڪائونٽ لاءِ استعمال ٿيل آهي

source: Email Subscriptions
sd: اي ميل سبسڪرپشن

source: English
sd: انگريزي ٻولي

source: Enter Email to Download
sd: ڊائون لوڊ ڪرڻ لاءِ اي ميل داخل ڪريو

source: Enter email to send a sign up link
sd: سائن اپ لنڪ موڪلڻ لاءِ اي ميل داخل ڪريو

source: Enter your email
sd: پنھنجي اي ميل داخل ڪريو

source: Enter your public domain sentence here
sd: پنھنجي عوامي ڊومين جو جملو هتي داخل ڪريو

source: Error adding sentence
sd: جملو شامل ڪرڻ ۾ غلطي

source: Error { $code }
sd: غلطي { $code }

source: Error while fetching rejected sentences. Please try again.
sd: رد ٿيل جملن کي آڻڻ ۾ ڪو نقص آهي. مهرباني ڪري ٻيهر ڪوشش ڪريو.

source: Error while fetching your sentences. Please try again.
sd: توهان جي جملن کي آڻڻ دوران نقص آهي. مهرباني ڪري ٻيهر ڪوشش ڪريو.

source: Erzya
sd: ارزيائي ٻولي

source: ESC
sd: اي ايس سي

source: Esperanto
sd: ايسپرانتيائي ٻولي

source: Estonian
sd: ايستونائي ٻولي

source: Events
sd: واقعا

source: Everyone
sd: هرڪو

source: Ewondo
sd: ايونڊائي

source: Example
sd: مثال

source: Exit & Delete clips
sd: ٻاھر وڃو ۽ ڪلپس ختم ڪريو

source: Expert linguists can also help, try to reach out to local linguistic universities (both teachers and students) and see if they can help to gather a diverse set of sound-diverse sentences in your language.
sd: ماهر لسانيات پڻ مدد ڪري سگھن ٿا، مقامي لساني يونيورسٽين (ٻئي استادن ۽ شاگردن) تائين پھچڻ جي ڪوشش ڪريو ۽ ڏسو ته ڇا اھي توھان جي ٻوليءَ ۾ آوازن جي متنوع جملن کي گڏ ڪرڻ ۾ مدد ڪري سگھن ٿا.

source: Failed to copy SHA256 Checksum
sd: SHA256 Checksum ڪاپي ڪرڻ ۾ ناڪام ٿيو

source: Failed to delete selected sentences… Please try again!
sd: منتخب ٿيل جملن کي حذف ڪرڻ ۾ ناڪام ٿيو... مهرباني ڪري ٻيهر ڪوشش ڪريو!

source: Faroese
sd: فيروز

source: Female
sd: عورت

source: Fewer than 15 words per sentence
sd: في جملي 15 لفظن کان گھٽ

source: Fields marked with an asterisk (*) are required.
sd: ستاري (*) سان نشان لڳل فيلڊ گهربل آهن.

source: File is too large
sd: فائل تمام وڏي آهي

source: File is too small
sd: فائل تمام ننڍي آهي

source: Filtered sentences due to requirements failing (please submit fixed versions as new sentences):
sd: فلٽر ٿيل جملا ناڪامي جي ضرورتن جي ڪري (مهرباني ڪري نئين جملن جي طور تي مقرر ٿيل ورجن جمع ڪريو):

source: Finding existing sentences in the Public Domain
sd: عوامي ڊومين ۾ موجود جملن کي ڳولهڻ

source: Find others who care. That could be universities, language schools, advocacy groups or data science communities. Reach out and explain clearly how they can help and why. <outreachTemplates>See our template outreach emails</outreachTemplates>.
sd: ٻين کي ڳوليو جيڪي خيال رکندا. اهو ٿي سگهي ٿو يونيورسٽيون، ٻولي اسڪول، وڪيل گروپ يا ڊيٽا سائنس ڪميونٽي. ٻاهر وڃو ۽ واضح طور تي وضاحت ڪريو ته اهي ڪيئن مدد ڪري سگهن ٿا ۽ ڇو. <outreachTemplates>ڏسو اسان جي ٽيمپليٽ outreach اي ميلون</outreachTemplates>.

source: Finish editing first?
sd: پهرين ترميم ختم ڪريو؟

source: Finish recording
sd: رڪارڊنگ مڪمل ڪريو

source: Finish recording first?
sd: پهرين رڪارڊنگ کي ختم ڪريو؟

source: Finish Review
sd: جائزو ختم ڪريو

source: Finish validating
sd: تصديق ڪرڻ ختم ڪريو

source: Finish validating clips?
sd: ڪلپس جي تصديق ختم ڪريو؟

source: Finnish
sd: فني ٻولي

source: First, check if your language <languageLink>already exists</languageLink>. If it isn’t, you can <languageRequestLink>ask about adding your language</languageRequestLink>. There are two stages. Translating the site, and collecting sentences
sd: پهرين، چيڪ ڪريو ته ڇا توهان جي ٻولي <languageLink>اڳ ۾ ئي موجود آهي</languageLink>. جيڪڏهن اهو نه آهي، توهان ڪري سگهو ٿا <languageRequestLink>پنهنجي ٻولي شامل ڪرڻ بابت پڇو</languageRequestLink>. اتي ٻه مرحلا آهن. سائيٽ جو ترجمو، ۽ جملن کي گڏ ڪرڻ

source: Foreign letters. Letters must be valid in the language being spoken. For example, “ж” is a letter in the Russian alphabet but is never used in English and so should never appear in any English source text.
sd: غير ملڪي خط. اکر لازمي طور تي صحيح هجڻ گهرجن ٻولي ۾ ڳالهائڻ. مثال طور، "ж" روسي الفابيٽ ۾ هڪ اکر آهي پر ڪڏهن به انگريزيء ۾ استعمال نه ڪيو ويو آهي تنهنڪري ڪنهن به انگريزي ماخذ جي متن ۾ ڪڏهن به ظاهر نه ٿيڻ گهرجي.

source: For every voice clip donated, and every audio clip validated, your account dashboards are updated to reflect your latest progress in each language you contribute to. Yes, you can contribute to more than one!<br/><br/> Use dashboards to track your stats, see how you're doing alongside others in the community, and set daily or weekly contribution goals.
sd: عطيو ڪيل هر وائيس ڪلپ لاءِ، ۽ هر آڊيو ڪلپ جي تصديق ڪئي وئي آهي، توهان جي اڪائونٽ ڊيش بورڊز کي اپڊيٽ ڪيو ويندو آهي ته جيئن توهان هر ٻولي ۾ توهان جي تازي پيش رفت کي ظاهر ڪرڻ لاءِ جيڪو توهان تعاون ڪيو. ها، توهان هڪ کان وڌيڪ حصو ڏئي سگهو ٿا!<br/><br/> پنهنجي انگن اکرن کي ٽريڪ ڪرڻ لاءِ ڊيش بورڊ استعمال ڪريو، ڏسو ته توهان ڪميونٽي ۾ ٻين سان گڏ ڪيئن پيا آهيو، ۽ روزاني يا هفتيوار تعاون جا مقصد مقرر ڪريو.

source: for example
sd: مثال طور

source: For public domain text not available online, you could use academic referencing style e.g Harvard style "Jess (2021) My Public licence poems"
sd: عوامي ڊومين لاءِ ٽيڪسٽ آن لائن دستياب ناهي، توهان استعمال ڪري سگهو ٿا اڪيڊمي ريفرنسنگ اسلوب مثال طور هارورڊ انداز ”جيس (2021) مائي پبلڪ لائسنس جون نظمون“

source: For public domain text that is not available online, you could use academic referencing style e.g Harvard style "Jess (2021) My Public license poems"
sd: پبلڪ ڊومين جي متن لاءِ جيڪو آن لائن دستياب ناهي، توهان استعمال ڪري سگهو ٿا تعليمي حوالي ڪرڻ وارو انداز مثال طور هارورڊ انداز ”جيس (2021) مائي پبلڪ لائسنس جون نظمون“

source: For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. For example, if we don't include any speakers with a particular accent, then the technology won't work well for people with that accent. <learnMore>Learn more about why metadata matters.</learnMore>
sd: ٽيڪنالاجي لاءِ هر ڪنهن لاءِ سٺو ڪم ڪرڻ لاءِ، ڊيٽا جيڪا ڊولپرز کي ٽيڪنالاجي ٺاهڻ ۾ مدد ڪري ٿي ماڻهن جي مختلف قسمن کي ظاهر ڪرڻ جي ضرورت آهي. مثال طور، جيڪڏهن اسان ڪنهن به ڳالهائيندڙن کي هڪ خاص تلفظ سان شامل نه ڪندا آهيون، ته پوءِ ٽيڪنالاجي انهي تلفظ سان ماڻهن لاءِ سٺو ڪم نه ڪندي. <وڌيڪ سکو>

source: For these launched languages the website has been successfully <localizationGlossaryLink>localized</localizationGlossaryLink>, and has enough <sentenceCollectionGlossaryLink>sentences collected</sentenceCollectionGlossaryLink> to allow for ongoing <speakLink>Speak</speakLink> and <listenLink>Listen</listenLink> contributions.
sd: نهن ٻولين لاءِ شروع ڪيل ويب سائيٽ ڪاميابيءَ سان <localizationGlossaryLink>مڪاني ڪئي وئي آهي</localizationGlossaryLink>، ۽ ڪافي <sentenceCollectionGlossaryLink>جملا گڏ ڪيا ويا آهن</sentenceCollectionGlossaryLink> جاري <speakLink>SpeakLink>Listen<Listen<Listen /listenLink>شراڪتون.

source: Foundations
sd: بنياد

source: French
sd: فرانسي ٻولي

source: Frequently Asked Questions
sd: اڪثر پڇيل سوال

source: Frisian
sd: فريسيئن

source: Fulah
sd: فيولائي ٻولي

source: Galician
sd: گاليشين

source: GB
sd: جي بي

source: Gender
sd: جنس

source: Georgian
sd: جيارجي ٻولي

source: German
sd: جرمني ٻولي

source: Get in touch
sd: رابطي ۾ رهو

source: Get involved
sd: شامل ٿيو

source: Get Involved
sd: شامل ٿيو

source: Get started with goals
sd: مقصدن سان شروع ڪريو

source: Get Started with Speech Recognition
sd: تقرير جي شناخت سان شروع ڪريو

source: <githubLink>NVIDIA NeMo</githubLink>™ is an <docsLink>open-source toolkit</docsLink> for researchers developing state-of-the-art conversational AI models.
sd: <githubLink>NVIDIA NeMo</githubLink>™ هڪ <docsLink>اوپن سورس ٽول ڪٽ</docsLink> آهي محققن لاءِ جيڪي جديد ترين گفتگو ڪندڙ AI ماڊل ٺاهي رهيا آهن.

source: Glossary
sd: لغت

source: Goal reached
sd: منزل تي پهچي ويو

source: Goals
sd: مقصد

source: Goan Konkani
sd: گون ڪانڪاڻي ٻولي

source: Go to Discourse
sd: گفتگو ڏانھن وڃو

source: Go to Languages Page
sd: ٻولين جي صفحي ڏانھن وڃو

source: Go to { $name }
sd: ڏانھن وڃو { $name }

source: <governanceLink>Read more about how we're governed</governanceLink>
sd: <governanceLink>وڌيڪ پڙهو ته اسان کي ڪيئن سنڀاليو وڃي ٿو </governanceLink>

source: Government proceedings, books and articles are also great however since the text tends to be a little more formal they are less of a priority.
sd: سرڪاري ڪارروايون، ڪتاب ۽ مقالا به وڏا هوندا آهن، پر جيئن ته متن ٿورو وڌيڪ رسمي هوندو آهي، انهن کي ترجيح ڏني ويندي آهي.

source: Governments
sd: حڪومتون

source: Grammatical / spelling error
sd: گرامر/ اسپيلنگ جي غلطي

source: Great! How many clips a week?
sd: زبردست! ڪيترا ڪلپس هڪ هفتي ۾؟

source: Great! How many clips per day?
sd: زبردست! ڪيترا ڪلپس في ڏينهن؟

source: Great!<recordIcon></recordIcon> Record your next clip
sd: زبردست! <recordicon></recordicon> پنھنجو ايندڙ ڪلپ رڪارڊ ڪريو

source: Great work!<playIcon></playIcon> Listen again when you're ready
sd: زبردست ڪم!<playIcon></playIcon> ٻيهر ٻڌو جڏهن توهان تيار آهيو

source: Greek
sd: يوناني ٻولي

source: Guarani
sd: گاراني ٻولي

source: Guidelines
sd: ھدايتون

source: Gujarati
sd: گجراتي ٻولي

source: Haitian
sd: هيتائي

source: Hakha Chin
sd: هاکا چني ٻولي

source: Hausa
sd: هوسا

source: Have Feedback?
sd: موٽ ڏيو؟

source: Have you read our Terms?
sd: ڇا توهان اسان جون شرطون پڙهيون آهن؟

source: Having an account is not required to contribute, though it is helpful.
sd: هڪ اڪائونٽ هجڻ ضروري ناهي ته حصو ڏيڻ لاءِ، پر اهو مددگار آهي.

source: Having a profile is not required to contribute though it is helpful, see why below.
sd: پروفائل هجڻ ضروري ناهي حصو ڏيڻ لاءِ پر اهو مددگار آهي، هيٺ ڏسو ڇو.

source: Hebrew
sd: عبراني ٻولي

source: Help
sd: مدد ڪريو

source: Help Common Voice reach { $hours } hours in a language with a personal goal
sd: مدد ڪريو عام آواز تائين رسائي { $hours } ڪلاڪن ۾ هڪ ذاتي مقصد سان

source: Help create Common Voice’s first target segment in { $locale }
sd: مدد ڪريو Common Voice جي پهرئين ٽارگيٽ سيگمينٽ { $locale } ۾

source: Help reach { $hours } hours in { $language } with a personal goal
sd: ذاتي مقصد سان { $hours } ڪلاڪن تائين { $language } ۾ مدد ڪريو

source: Help teach machines how real people speak, donate your voice at { $link }
sd: مشينن کي سيکارڻ ۾ مدد ڪريو ته حقيقي ماڻهو ڪيئن ڳالهائيندا آهن، پنهنجو آواز ڏيو { $link }

source: Help us build a community around voice technology, stay in touch via email.
sd: آواز ٽيڪنالاجي جي چوڌاري هڪ ڪميونٽي ٺاهڻ ۾ اسان جي مدد ڪريو، اي ميل ذريعي رابطي ۾ رهو.

source: Help us build a high quality, publicly open dataset
sd: اسان جي مدد ڪريو هڪ اعليٰ معيار، عوامي طور تي کليل ڊيٽا سيٽ ٺاهڻ ۾

source: Help us by reviewing sentences for correctness according to the guidelines.
sd: ھدايتن جي مطابق درستي لاءِ جملن جو جائزو وٺڻ ۾ اسان جي مدد ڪريو.

source: Help us by writing or collecting Public Domain sentences.
sd: عوامي ڊومين جا جملا لکڻ يا گڏ ڪرڻ ۾ اسان جي مدد ڪريو.

source: Help us find more voices, share your goal
sd: اسان جي وڌيڪ آواز ڳولڻ ۾ مدد ڪريو، پنھنجي مقصد کي حصيداري ڪريو

source: Help us find others to donate their voice!
sd: اسان کي ٻين کي ڳولڻ ۾ مدد ڪريو جيڪي پنهنجو آواز ڏئي سگھن ٿا!

source: Help us get to { $goal }
sd: اسان کي { $goal } حاصل ڪرڻ ۾ مدد ڪريو

source: Help us validate sentences!
sd: اسان جي مدد ڪريو جملن کي درست ڪرڻ ۾!

source: Help us validate voices
sd: آوازن جي تصديق ڪرڻ ۾ اسان جي مدد ڪريو

source: Here are some tips to find sentences:
sd: هتي جملن کي ڳولڻ لاء ڪجهه طريقا آهن:

source: Here are the links to download your ZIP files.
sd: هتي آهن لنڪ توهان جي زپ فائلن کي ڊائونلوڊ ڪرڻ لاءِ.

source: Hidden
sd: لڪيل

source: Hiligaynon
sd: هيليگينائي

source: Hill Mari
sd: هلمري ٻولي

source: Hindi
sd: هندي ٻولي

source: His hand was rais-ed.
sd: هن جو هٿ مٿي ڪيو ويو.

source: Home
sd: گهر

source: Hours
sd: ڪلاڪ

source: Hours Recorded
sd: رڪارڊ ٿيل ڪلاڪ

source: Hours Validated
sd: رڪارڊ ٿيل ڪلاڪ

source: { $hours } validated hours so far!
sd: { $hours } تصديق ٿيل ڪلاڪ هينئر تائين!

source: How ?
sd: ڪيئن؟

source: How are project decisions made?
sd: منصوبي جا فيصلا ڪيئن ڪيا ويا آهن؟

source: How can I get the Common Voice data?
sd: آئون ڪيئن حاصل ڪري سگهان ٿو عام آواز ڊيٽا؟

source: How can we effectively grow a language on Common Voice?
sd: اسان ڪئين مؤثر طريقي سان هڪ ٻولي کي عام آواز تي وڌائي سگهون ٿا؟

source: How does Common Voice calculate hours?
sd: عام آواز ڪلاڪن جو حساب ڪيئن ڪندو آهي؟

source: How does Common Voice work?
sd: عام آواز ڪيئن ڪم ڪندو آهي؟

source: How does site localization work?
sd: سائيٽ لوڪلائيزيشن ڪيئن ڪم ڪندو آهي؟

source: How do I access and use the dataset?
sd: آئون ڊيٽا سيٽ تائين ڪيئن رسائي ۽ استعمال ڪري سگهان ٿو؟

source: How do I add a language?
sd: مان هڪ ٻولي ڪيئن شامل ڪري سگهان ٿو؟

source: How do I add sentences?
sd: آئون ڪئين جملا شامل ڪري سگهان ٿو؟

source: How do I cite?
sd: آئون ڪيئن بيان ڪريان؟

source: How do I know whether to approve a voice clip?
sd: آئون ڪيئن ڄاڻان ته وائيس ڪلپ کي منظور ڪيو وڃي؟

source: How do I record a high quality voice clip?
sd: آئون هڪ اعليٰ معيار جو آواز ڪلپ ڪيئن رڪارڊ ڪري سگهان ٿو؟

source: How do I stay in touch?
sd: آئون رابطي ۾ ڪيئن رهان؟

source: How do you ensure anonymity and privacy of the people who donated their voices?
sd: توهان انهن ماڻهن جي گمنام ۽ رازداري کي ڪيئن يقيني بڻائيندا آهيو جن پنهنجو آواز ڏنو؟

source: How to
sd: ڪيئن

source: How-to
sd: ڪھڙي طرح

source: How to Cite
sd: ڪيئن بيان ڪجي

source: How would you describe your accent?
sd: توهان پنهنجي تلفظ کي ڪيئن بيان ڪندا؟

source: Hungarian
sd: هنگري ٻولي

source: I agree
sd: آئون متفق آهيان

source: I agree to Common Voice's <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
sd: مان متفق آهيان Common Voice جي <termsLink>شرائط</termsLink> ۽ <privacyLink>رازداري نوٽيس</privacyLink>

source: I am a non-native speaker and I speak with an accent, do you still want my voice?
sd: مان هڪ غير مقامي ڳالهائيندڙ آهيان ۽ مان هڪ تلفظ سان ڳالهائيندو آهيان، ڇا توهان اڃا تائين منهنجي آواز چاهيو ٿا؟

source: Icelandic
sd: آئس لينڊي ٻولي

source: I confirm that these sentence are <wikipediaLink>public domain</wikipediaLink> and I have permission to upload them.
sd: مان تصديق ڪريان ٿو ته اهي جملا <wikipediaLink>عوامي ڊومين</wikipediaLink> آهن ۽ مون کي انهن کي اپ لوڊ ڪرڻ جي اجازت آهي.

source: I confirm that these sentences are <wikipediaLink>public domain</wikipediaLink> and I have permission to upload them.
sd: مان تصديق ڪريان ٿو ته اهي جملا <wikipediaLink>عوامي ڊومين</wikipediaLink> آهن ۽ مون کي انهن کي اپ لوڊ ڪرڻ جي اجازت آهي.

source: I confirm that this sentence is <wikipediaLink>public domain</wikipediaLink> and I have permission to upload it.
sd: آئون تصديق ڪريان ٿو ته هي جملو <wikipediaLink>عوامي ڊومين</wikipediaLink> آهي ۽ مون وٽ ان کي اپلوڊ ڪرڻ جي اجازت آهي.

source: Ideally natural and conversational (it should be easy to read the sentence)
sd: مثالي طور تي قدرتي ۽ گفتگو ڪندڙ (اهو جملو پڙهڻ ۾ آسان هجڻ گهرجي)

source: I'd like to receive emails such as goal reminders, my progress updates and newsletters about Common Voice.
sd: آئون حاصل ڪرڻ چاهيان ٿو اي ميلون جهڙوڪ مقصد ياد ڏياريندڙ، منهنجي پيش رفت تازه ڪاريون ۽ خبر ناما عام آواز بابت.

source: I do not agree
sd: آئون متفق نه آهيان

source: If a clip is rejected by 2 people, it is released in a different subset of the dataset.
sd: جيڪڏهن هڪ ڪلپ 2 ماڻهن طرفان رد ڪيو ويو آهي، اهو ڊيٽا سيٽ جي مختلف ذيلي سيٽ ۾ جاري ڪيو ويو آهي.

source: If it’s your own words, just say <italicizedText>“Self Citation”</italicizedText>. We need to know where you found this content so that we can check it is in the public domain and no copyright restrictions apply. For more information about citation see our <guidelinesLink>Guidelines page</guidelinesLink>.
sd: جيڪڏھن اھو توھان جا پنهنجا لفظ آھن، بس چئو <italicizedText>"Self Citation"</italicizedText>. اسان کي ڄاڻڻ جي ضرورت آهي ته توهان هي مواد ڪٿي مليو آهي ته جيئن اسان چيڪ ڪري سگهون ته اهو عوامي ڊومين ۾ آهي ۽ ڪاپي رائيٽ جي پابندي لاڳو ناهي. حوالن بابت وڌيڪ معلومات لاءِ ڏسو اسان جو

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
sd: جيڪڏهن رڪارڊ ٽوڙيو وڃي، يا ڦاٽل هجي، رد ڪريو جيستائين پوري متن کي اڃا تائين ٻڌي سگهجي.

source: If the sentence does not meet the above criteria, click the "No" button.
sd: جيڪڏهن جملو مٿي ڏنل معيار کي پورو نٿو ڪري، "نه" بٽڻ تي ڪلڪ ڪريو.

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
sd: جيڪڏهن جملو مٿي ڏنل معيار کي پورو نٿو ڪري، ڪلڪ ڪريو &quot;رد ڪريو&quot; کاٻي پاسي بٽڻ. جيڪڏهن توهان کي جملي جي باري ۾ تصديق نه آهي، ته توهان ان کي ڇڏي به سگهو ٿا ۽ اڳتي وڌو.

source: If the sentence does not meet the above criteria, click the "Reject" button. If you are unsure about the sentence, you may also skip it and move on to the next one.
sd: جيڪڏهن جملو مٿي ڏنل معيار کي پورو نٿو ڪري، "رد" بٽڻ تي ڪلڪ ڪريو. جيڪڏهن توهان کي سزا بابت يقين نه آهي، ته توهان ان کي پڻ ڇڏي ڏيو ۽ اڳتي وڌو.

source: If the sentence is offensive or upsetting - for example because of explicit content, or another violation of our <communityGuidelines>community participation guidelines</communityGuidelines> - you should reject the sentence. You can also reach out to us at <emailFragment>commonvoice@mozilla.com</emailFragment> to escalate the issue.
sd: جيڪڏهن جملو ناگوار يا پريشان ڪندڙ آهي - مثال طور واضح مواد جي ڪري، يا اسان جي <communityGuidelines>ڪميونٽي شرڪت جي رهنمائي</communityGuidelines> جي خلاف ورزي جي ڪري - توهان کي جملي کي رد ڪرڻ گهرجي. توهان پڻ اسان سان رابطو ڪري سگهو ٿا <emailFragment>commonvoice@mozilla.com</emailFragment> تي مسئلو وڌائڻ لاءِ.

source: If the sentence meets the criteria above, click the "Yes" button.
sd: جيڪڏهن جملو مٿي ڏنل معيار کي پورو ڪري ٿو ته، "ها" بٽڻ کي دٻايو.

source: If the sentence meets the criteria, click the "Approve" button.
sd: جيڪڏهن جملو معيار کي پورو ڪري ٿو، "منظور ڪريو" بٽڻ تي ڪلڪ ڪريو.

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
sd: جيڪڏهن جملو معيار تي پورو لهي ٿو، "منظور ڪريو" تي ڪلڪ ڪريو. ساڄي پاسي وارو بٽڻ.

source: If you are unsure about the sentence, you may also skip it and move on to the next one.
sd: جيڪڏهن توهان جملي جي باري ۾ پخته نه آهيو، ته توهان ان کي ڇڏي به سگهو ٿا ۽ اڳتي وڌو.

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
sd: جيڪڏهن توهان ڪنهن شيءِ ۾ اچو ته اهي هدايتون نه ڍڪينديون آهن، مهرباني ڪري پنهنجي بهترين فيصلي جي مطابق ووٽ ڏيو. جيڪڏهن توهان واقعي فيصلو نٿا ڪري سگهو، بٽڻ کي استعمال ڪريو ڇڏي ڏيو ۽ ايندڙ رڪارڊنگ تي وڃو.

source: If you could <strong>hear them</strong> and <strong>understand them</strong>, it’s usually <strong>best to approve</strong>.
sd: جيڪڏهن توهان <strong>انهن کي ٻڌي</strong> ۽ <strong>سمجهي سگهو ٿا</strong>، ته اهو عام طور تي <strong>منظور ڪرڻ بهتر آهي</strong>.

source: If you don’t hear from us within a couple of days, reach out at <emailLink>{ $email }</emailLink> and we’ll get back to you!
sd: جيڪڏهن توهان اسان کان ڪجهه ڏينهن اندر نه ٻڌو ته، <emailLink>{ $email }</emailLink> تي رابطو ڪريو ۽ اسان توهان ڏانهن واپس آڻينداسين!

source: If you’re looking for tools to build ASR models, you can connect to other people in the community <discourseLink>on Discourse</discourseLink>.
sd: جيڪڏهن توهان ASR ماڊل ٺاهڻ لاءِ اوزار ڳولي رهيا آهيو، توهان ڪميونٽي جي ٻين ماڻهن سان ڳنڍي سگهو ٿا <discourseLink>on Discourse</discourseLink>.

source: If you're looking to speak more about the dataset, want to co-invest in planned platform expansions or look for collaboration opportunities, <emailFragment>drop us a line.</emailFragment>
sd: جيڪڏهن توهان ڊيٽا سيٽ بابت وڌيڪ ڳالهائڻ چاهيو ٿا، رٿيل پليٽ فارم جي توسيع ۾ گڏيل سيڙپڪاري ڪرڻ چاهيو ٿا يا تعاون جا موقعا ڳولڻ چاهيو ٿا، <emailFragment>اسان کي هڪ لڪير ڏيو.</emailFragment>

source: If your language is not listed here, you can request it through <languageProcessLink>this process</languageProcessLink>.
sd: جيڪڏهن توهان جي ٻولي هتي درج نه آهي، توهان ان جي ذريعي درخواست ڪري سگهو ٿا <languageProcessLink>هن پروسيس</languageProcessLink>.

source: If you run out of sentences to review, please help us collect more sentences!
sd: جيڪڏھن توھان جي نظرثاني ڪرڻ لاءِ جملا ختم ٿي ويا آھن، مھرباني ڪري وڌيڪ جملا گڏ ڪرڻ ۾ اسان جي مدد ڪريو!

source: If you think the pronunciation makes it <strong>impossible to understand</strong>, or there’s a <strong>lot of background noise</strong>, or there are <strong>other people speaking too</strong>, then you should reject the clip. <accuracyLink>See more information in our accuracy criteria</accuracyLink>.
sd: جيڪڏهن توهان سوچيو ته تلفظ ان کي <strong>سمجھڻ ناممڪن</strong> بڻائي ٿو، يا اتي <strong>گهڻو پس منظر شور</strong> آهي، يا اتي آهن <strong>ٻيا ماڻهو پڻ ڳالهائي رهيا آهن</strong>، ته پوءِ توهان ڪلپ کي رد ڪرڻ گهرجي. <accuracyLink>اسان جي درستگي جي معيار ۾ وڌيڪ معلومات ڏسو</accuracyLink>.

source: Igbo
sd: اگبو ٻولي

source: I just created a personal goal for voice donation to #CommonVoice -- join me and help teach machines how real people speak { $link }
sd: مون صرف #CommonVoice لاءِ آواز جي عطئيءَ لاءِ هڪ ذاتي مقصد ٺاهيو آهي -- مون سان شامل ٿيو ۽ مشينن کي سيکارڻ ۾ مدد ڪريو ته حقيقي ماڻهو ڪيئن ڳالهائين ٿا { $link }

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
sd: آئون مطمئن آهيان توهان هن معلومات کي سنڀالڻ سان جيئن توهان Mozilla جي <privacyLink>پرائيويسي پاليسي</privacyLink> ۾ وضاحت ڪري رهيا آهيو

source: Include appropriate citation
sd: مناسب حوالو شامل ڪريو

source: Includes email, username & demographic info, available right away
sd: شامل آهي اي ميل، صارف جو نالو ۽ ڊيموگرافڪ ڄاڻ، فوري طور تي دستياب

source: Includes mp3s and related sentences, may take some time to prepare
sd: شامل آھن mp3s ۽ لاڳاپيل جملا، تيار ٿيڻ ۾ ڪجھ وقت وٺي سگھي ٿو

source: Indonesian
sd: انڊونيشي ٻولي

source: Information about the language
sd: ٻوليءَ بابت ڄاڻ

source: In Progress
sd: جاري آهي

source: Interested in learning more and contributing to the project?
sd: وڌيڪ سکڻ ۽ منصوبي ۾ حصو وٺڻ ۾ دلچسپي رکو ٿا؟

source: Interface Language
sd: انٽرفيس ٻولي

source: Interlingua
sd: انٽرلنگوائي

source: Interlingue
sd: انٽرلنگي ٻولي
